Catalogs/ИА_ПланыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ПланыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
								<v8:Type>cfg:EnumRef.ИА_ТипыЗадачБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтатистики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвотаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееЗначениеСтатистики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущийПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗа3Недели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пост</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КСУ_СобытияКалендаряGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_СобытияКалендаряGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>БезВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>идСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ЗадачиКЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ЗадачиКЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИндКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндКартинкиТипЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндКартинкиПриоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПользовательКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Корзина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_РасширенияКомцентра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ТипыЗадачБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЗадачБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регулярные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стратегические</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ПланыДействий/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура СформироватьНаименование()
	объект.Наименование = Строка(Объект.Ответственный)+ " " +  формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкуСтатистики(пПост)
	Возврат пПост.НастройкаСтатистик;
КонецФункции


&НаСервере
Процедура ДобавитьСобытияГугл()
	Если Объект.ДатаНачала = Дата(1,1,1) или Объект.ДатаКонца = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли;
	
	тд = ПолучитьСтрокуДляДобавления(Перечисления.ИА_ТипыЗадачБП.Задачи);
	
	Если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_СобытияКалендаряGoogle.Пользователь,
	               |	КСУ_СобытияКалендаряGoogle.идСобытия КАК идСобытияГугл,
	               |	КСУ_СобытияКалендаряGoogle.ДатаНачала,
	               |	КСУ_СобытияКалендаряGoogle.ДатаКонца,
	               |	КСУ_СобытияКалендаряGoogle.Описание,
	               |	КСУ_СобытияКалендаряGoogle.БезВремени
	               |ИЗ
	               |	РегистрСведений.КСУ_СобытияКалендаряGoogle КАК КСУ_СобытияКалендаряGoogle
	               |ГДЕ
	               |	КСУ_СобытияКалендаряGoogle.Пользователь = &Пользователь
	               |	И КСУ_СобытияКалендаряGoogle.ДатаНачала <= &ДатаКонца
	               |	И КСУ_СобытияКалендаряGoogle.ДатаКонца >= &ДатаНачала";
	Запрос.УстановитьПараметр("Пользователь",объект.Ответственный);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(Объект.ДатаКонца));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	текСтроки = тд.ПолучитьЭлементы();	
	Новстр = Неопределено;
	Пока Выборка.Следующий() Цикл
		Прерв = ложь;
		для каждого стр1 из текСтроки Цикл
			если стр1.идСобытияГугл = Выборка.идСобытияГугл Тогда
				прерв = истина;
				прервать;
			КонецЕсли;
		КонецЦикла;
		Если прерв Тогда
			продолжить;
		КонецЕсли;
		
		Новстр = текСтроки.Добавить();
		Новстр.идСобытияГугл = Выборка.идСобытияГугл;
		Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач Тогда
			Новстр.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи;
		КонецЕсли;
		Новстр.Содержание = Выборка.Описание;
		Новстр.СрокИсполнения = Выборка.ДатаКонца;
		Новстр.Пост = Объект.Пост;
		Если Выборка.БезВремени тогда
			Новстр.ВремяПлан = Дата(1,1,1,1,0,0);
		Иначе
			Новстр.ВремяПлан =  Дата(1,1,1,0,0,0) + (Выборка.ДатаКонца - Выборка.ДатаНачала);
		КонецЕсли;
	КонецЦикла;
	
	Если Новстр <> Неопределено Тогда 
		Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсеЗадачи()
	Если Объект.ДатаНачала = Дата(1,1,1) или Объект.ДатаКонца = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли;
	
	тд = ПолучитьСтрокуДляДобавления(Перечисления.ИА_ТипыЗадачБП.Задачи);
	
	Если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийИА_ЗадачиКЦ.ПользовательКЦ,
	               |	РегистрСведенийИА_ЗадачиКЦ.Корзина,
	               |	РегистрСведенийИА_ЗадачиКЦ.Ссылка,
	               |	РегистрСведенийИА_ЗадачиКЦ.Автор,
	               |	РегистрСведенийИА_ЗадачиКЦ.Наименование,
	               |	РегистрСведенийИА_ЗадачиКЦ.Дата,
	               |	РегистрСведенийИА_ЗадачиКЦ.СрокИсполнения,
	               |	РегистрСведенийИА_ЗадачиКЦ.Пользователь,
	               |	РегистрСведенийИА_ЗадачиКЦ.Исполнитель,
	               |	РегистрСведенийИА_ЗадачиКЦ.Пост
	               |ИЗ
	               |	РегистрСведений.ИА_ЗадачиКЦ КАК РегистрСведенийИА_ЗадачиКЦ
	               |ГДЕ
	               |	РегистрСведенийИА_ЗадачиКЦ.ПользовательКЦ = &ПользовательКЦ
	               |	И (РегистрСведенийИА_ЗадачиКЦ.Корзина = &КорзинаВх
	               |			ИЛИ РегистрСведенийИА_ЗадачиКЦ.Корзина = &КорзинаВработе)
	               |	И РегистрСведенийИА_ЗадачиКЦ.СрокИсполнения МЕЖДУ &ДатаНачала И &ДатаКонца";
	Запрос.УстановитьПараметр("ПользовательКЦ",объект.Ответственный);
	Запрос.УстановитьПараметр("КорзинаВх", Справочники.ИА_РасширенияКомцентра.Входящие);
	Запрос.УстановитьПараметр("КорзинаВработе", Справочники.ИА_РасширенияКомцентра.ВРаботе);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(Объект.ДатаКонца));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	текСтроки = тд.ПолучитьЭлементы();	
	Новстр = Неопределено;
	Пока Выборка.Следующий() Цикл
		Прерв = ложь;
		для каждого стр1 из текСтроки Цикл
			если стр1.ЗадачаОснование = Выборка.ссылка Тогда
				прерв = истина;
				прервать;
			КонецЕсли;
		КонецЦикла;
		Если прерв Тогда
			продолжить;
		КонецЕсли;
		
		Новстр = текСтроки.Добавить();
		Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач Тогда
			Новстр.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи;
		КонецЕсли;
		Новстр.Содержание = Выборка.Наименование;
		Новстр.СрокИсполнения = Выборка.СрокИсполнения;
		Новстр.ЗадачаОснование = Выборка.ссылка;
		Новстр.Пост = Объект.Пост;
		Новстр.ВремяПлан = Дата(1,1,1,1,0,0);
		Новстр.индКартинки = 1;
	КонецЦикла;
	
	Если Новстр <> Неопределено Тогда 
		Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СокрВид = Константы.КСУ_СокращенныйВидПлана.Получить();
	ВидГруппировки = константы.КСУ_ГруппировкаЗадачПлана.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Если Параметры.Свойство("Начало") Тогда
				Объект.ДатаНачала = Параметры.Начало;
			Иначе
				Объект.ДатаНачала = Параметры.ЗначениеКопирования.ДатаКонца + 60*60*24 + 1;
			КонецЕсли;
			Объект.ДатаКонца = Объект.ДатаНачала+ 60*60*24 * ?(Параметры.ЗначениеКопирования.Родитель.Пустая(),6,0);
			Объект.Родитель = Параметры.ЗначениеКопирования.Родитель;
			
			Если не Объект.Родитель.Пустая() И Объект.ДатаНачала > Объект.Родитель.ДатаКонца Тогда
				Сообщить("Нельзя создавать дневной план датой больше даты конца недельного.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Объект.Пост = Параметры.ЗначениеКопирования.Пост;
			
			обновитьДерево(Параметры.ЗначениеКопирования, истина,Параметры.ЗадачаОснование);	
			
			Объект.План.Очистить();
		ИначеЕсли ЗначениеЗаполнено(Параметры.Родитель) Тогда
			// если выбрали дневной, то родитель - недельный
			род = ?(Параметры.Родитель.Родитель.Пустая(), Параметры.Родитель, Параметры.Родитель.Родитель); 
			Объект.Родитель = род;
			Если ЗначениеЗаполнено(Параметры.ДатаДневногоПлана) Тогда
				Объект.ДатаНачала = Параметры.ДатаДневногоПлана;
			Иначе
				Объект.ДатаНачала = ПолучитьДатуДневногоПлана(Объект.Родитель);
			КонецЕсли;
			Объект.Пост = Параметры.Родитель.Пост;
			
			Если Объект.ДатаНачала > род.ДатаКонца Тогда
				Сообщить("Нельзя создавать дневной план датой больше даты конца недельного.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			предПлан = ИА_Планы.ПолучитьДневнойПлан(Объект.Родитель, Объект.ДатаНачала - 60*60*24);
			Если предПлан<>Неопределено Тогда
				обновитьДерево(предПлан, истина,Параметры.ЗадачаОснование);	
			КонецЕсли;
			
			Объект.ДатаКонца = Объект.ДатаНачала;
		ИначеЕсли Параметры.Свойство("Начало") Тогда
				Объект.ДатаНачала = Параметры.Начало;
				Объект.ДатаКонца = Объект.ДатаНачала+ 60*60*24 * ?(Параметры.ЗначениеКопирования.Родитель.Пустая(),6,0);
		КонецЕсли;
		
		Объект.Утверждено = Ложь;
		Объект.ДатаУтверждения = Дата(1,1,1);
		Объект.Утвердил = Справочники.Пользователи.ПустаяСсылка();
		
		Если Дерево.ПолучитьЭлементы().Количество()=0 Тогда
			обновитьДерево(объект.Ссылка);	
		КонецЕсли;
		
		ДобавитьВсеСтратегическиеЗадачи();
		ДобавитьВсеЗадачи();		
		ДобавитьСобытияГугл();
	КонецЕсли;
	
	Если Дерево.ПолучитьЭлементы().Количество()=0 Тогда
		обновитьДерево(объект.Ссылка);	
	КонецЕсли;
	
	МоиПосты = МоиПолучитьПосты(объект.Ответственный);
	Если Объект.План.Количество() = 0 Тогда
		ЗагрузитьСтатистики(МоиПосты);
	КонецЕсли;

	//
	зОсн = Параметры.ЗадачаОснование;
	Если ЗначениеЗаполнено(зОсн) Тогда
		тд = Неопределено;
		Если ТипЗнч(зОсн) = тип("СправочникСсылка.ИА_ЗадачиПлана") ТОгда
			Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.НеГруппировать или ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния Тогда
				тд = Дерево;
			Иначе
				Для каждого стр из Дерево.ПолучитьЭлементы() Цикл
					Если стр.Группировка = зОсн.Группировка Тогда
						тд = стр;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Новстр = тд.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(новстр,зОсн);
			Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния Тогда
				Новстр.Группировка = Неопределено;
			КонецЕсли;
			Новстр.Выполнено = ложь;
			Новстр.ВремяПлан = Дата(1,1,1,1,0,0);
			Новстр.ВремяФакт = Дата(1,1,1,0,0,0);
			
			Если ЗначениеЗаполнено(Новстр.ЗадачаОснование) ТОгда
				Если ТипЗнч(Новстр.ЗадачаОснование)  = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") ТОгда
					Новстр.индКартинки = 1;
				ИначеЕсли ТипЗнч(Новстр.ЗадачаОснование)  = тип("СправочникСсылка.ИА_СтратегическоеУправление") ТОгда
					Новстр.индКартинки = 2;
				КонецЕсли;
			КонецЕсли;
			Новстр.Ссылка = Справочники.ИА_ЗадачиПлана.ПустаяСсылка();
		ИначеЕсли ТипЗнч(зОсн) = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") ТОгда
			тд = ПолучитьСтрокуДляДобавления(Перечисления.ИА_ТипыЗадачБП.Задачи);
			
			Новстр = тд.ПолучитьЭлементы().Добавить();
			Новстр.ЗадачаОснование = зОсн;
			Новстр.Пост = зОсн.Пост;
			Если Новстр.Пост.Пустая() ТОгда
				Новстр.Пост = Объект.Пост;
			КонецЕсли;
			
			Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач Тогда
				Новстр.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи;
			КонецЕсли;
			Новстр.Содержание = зОсн.Наименование;
			Новстр.ВремяПлан = Дата(1,1,1,1,0,0);
			Новстр.ВремяФакт = Дата(1,1,1,0,0,0);
			Новстр.индКартинки = 1;
			Новстр.Ссылка = Справочники.ИА_ЗадачиПлана.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	// добавление задачи из программы доступно только при установленной админшкале
	Попытка
		прогр = Справочники["ИА_СтратегическоеУправление"].ПустаяСсылка();
	Исключение
		Элементы.ШагиДобавитьЗадачуИзПрограммы.Видимость = ложь;
	КонецПопытки;
	
	ОбновитьЗаголовкиВидимость();

	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	Элементы.ШагиПост.СписокВыбора.ЗагрузитьЗначения(МоиПосты);
	Элементы.ПланПост.СписокВыбора.ЗагрузитьЗначения(МоиПосты);
	Элементы.Пост.СписокВыбора.ЗагрузитьЗначения(МоиПосты);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуДневногоПлана(недельный)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ИА_ПланыДействий.ДатаНачала) КАК ДатаНачала
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |ГДЕ
	               |	ИА_ПланыДействий.Родитель = &Родитель
	               |	И ИА_ПланыДействий.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Родитель", недельный);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
		тд = Выборка.ДатаНачала+ 60*60*24+1;;
	Иначе
		тд = недельный.ДатаНачала;
	КонецЕсли;
	
	Возврат тд;
КонецФункции

&НаСервере
Процедура обновитьДерево(план, ЭтоКопирование = ложь, ИсключитьЗадачу = Неопределено)
	
	ДерРез = РеквизитФормыВЗначение("Дерево");
	
	ИА_Защита_БП.ПолучитьДеревоПлана(ДерРез, план, Объект.Состояние, ЭтоКопирование, ,ИсключитьЗадачу);
			
	ЗначениеВРеквизитФормы(ДерРез, "Дерево");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("БП") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	// доступность статистики
	Попытка
		ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма");
	Исключение
		Элементы.ПланПоказатьСтатистику.Видимость = ложь;
	КонецПопытки;
	//
	
	// если скопировали
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если ЭтоНовый Тогда
		СформироватьНаименование();
	КонецЕсли;
	
	
	ОбновитьДоступность();
	ВывестиИтогВремени();
	
	Если Объект.ДатаКонца = Дата(1,1,1) Тогда
		ДневникПериодС =  ТекущаяДата() - 60*60*24*14;
	Иначе
		ДневникПериодС =  Объект.ДатаКонца - 60*60*24*14;
	КонецЕсли;
	ОбновитьДневник(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПлана(Команда)
	//Если СокрВид ТОгда
	//	ТабДок = Печать_Сервер_Сокр();
	//Иначе
	//	ТабДок = Печать_Сервер();
	//КонецЕсли;
	ТабДок = Печать_Сервер();
	ТабДок.Показать();	
КонецПроцедуры

&НаСервере
Функция Печать_Сервер_Сокр()
	дер = РеквизитФормыВЗначение("Дерево");
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Справочники.ИА_ПланыДействий.ПолучитьМакет("БоевойПланСокр");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Заполнить(Объект);
	ОблШапка.Параметры.Start = Объект.ДатаНачала;
	ОблШапка.Параметры.End = Объект.ДатаКонца;
	ОблШапка.Параметры.Пост = Объект.Пост.НаименованиеДляОргсхемы;
	ТабДок.Вывести(ОблШапка);
	
	// Статистики
	Для каждого стр из Объект.План Цикл
		ОблШапка = Макет.ПолучитьОбласть("СтрокаСтат");
		ОблШапка.Параметры.Заполнить(стр);
		ТабДок.Вывести(ОблШапка);
	КонецЦикла;
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОблШапка);
	

	// Задачи
	ИтВр = Дата(1,1,1);
	сч = 1;
	Для каждого стр из Дер.Строки Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаПлан");
		ОблСтрока.Параметры.нпп = строка(сч)+".";
		ОблСтрока.Параметры.Содержание = стр.Содержание;
		ОблСтрока.Параметры.Время = стр.ВремяПлан;
		ОблСтрока.Параметры.Выполнено = стр.Выполнено;
		ИтВр = СложитьВремя(ИтВр, стр.ВремяПлан);
		ТабДок.Вывести(ОблСтрока);
		
		сч = сч + 1;
	КонецЦикла;
	
	ОблСтрока = Макет.ПолучитьОбласть("СтрокаИтогПлан");	
	ОблСтрока.Параметры.Время = ФорматИтога(ИтВр);
	ТабДок.Вывести(ОблСтрока);
	
	// 
	ОблПодпись = Макет.ПолучитьОбласть("Подвал");
	Если не Объект.Пост.Родитель.Пустая() и Объект.Пост.Родитель.Сотрудники.Количество()>0 Тогда
		ОблПодпись.Параметры.Утвердил = Объект.Пост.Родитель.Сотрудники[0].ФизЛицо;
	Иначе
		ОблПодпись.Параметры.Утвердил = Объект.Утвердил;
	КонецЕсли;
	ТабДок.Вывести(ОблПодпись);
	//

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
КонецФункции


&НаСервере
Функция Печать_Сервер()
	дер = РеквизитФормыВЗначение("Дерево");
	
	ТабДок = Новый ТабличныйДокумент;
	Если СокрВид Тогда
		Макет = Справочники.ИА_ПланыДействий.ПолучитьМакет("БоевойПланСокр");
	Иначе
		Макет = Справочники.ИА_ПланыДействий.ПолучитьМакет("БоевойПлан");
	КонецЕсли;
	
	Если Объект.Родитель.Пустая() Тогда
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.End = Объект.ДатаКонца;
	ИНаче
		ОблШапка = Макет.ПолучитьОбласть("ШапкаДень");
	КонецЕсли;
	
	ОблШапка.Параметры.Заполнить(Объект);
	ОблШапка.Параметры.Start = Объект.ДатаНачала;
	ОблШапка.Параметры.Пост = Объект.Пост.НаименованиеДляОргсхемы;
	ТабДок.Вывести(ОблШапка);
	
	// Статистики
	Для каждого стр из Объект.План Цикл
		ОблШапка = Макет.ПолучитьОбласть("СтрокаСтат");
		ОблШапка.Параметры.Заполнить(стр);
		ТабДок.Вывести(ОблШапка);
	КонецЦикла;
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОблШапка);
	

	// Задачи
	ИтВр = Дата(1,1,1);
	ИтВрФакт = Дата(1,1,1);
	
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		сч = 1;
		Для каждого стр из Дер.Строки Цикл
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаПлан");
			ОблСтрока.Параметры.нпп = строка(сч)+".";
			ОблСтрока.Параметры.Содержание = стр.Содержание;
			ОблСтрока.Параметры.Время = стр.ВремяПлан;
			ОблСтрока.Параметры.Выполнено = стр.Выполнено;
			ИтВр = СложитьВремя(ИтВр, стр.ВремяПлан);
			ИтВрФакт = СложитьВремя(ИтВрФакт, стр.ВремяФакт);
			ТабДок.Вывести(ОблСтрока);
			
			сч = сч + 1;
		КонецЦикла;
	Иначе
		сч = 1;
		Для каждого стрШаг из Дер.Строки Цикл
			Если стрШаг.Группировка = Неопределено Тогда
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаПлан");
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, стрШаг);
				ОблСтрока.Параметры.нпп = строка(сч)+".";
				
				ИтВр = СложитьВремя(ИтВр, стрШаг.ВремяПлан);
				ИтВрФакт = СложитьВремя(ИтВрФакт, стрШаг.ВремяФакт);
				
				сч = сч + 1;
			Иначе
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаШаг");
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, стрШаг);
			КонецЕсли;
			ТабДок.Вывести(ОблСтрока);			
			
			для каждого стр из стрШаг.Строки Цикл
				ОблСтрока = Макет.ПолучитьОбласть("СтрокаПлан");
				ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры, стр);
				ОблСтрока.Параметры.нпп = строка(сч)+".";
				
				ИтВр = СложитьВремя(ИтВр, стр.ВремяПлан);
				ИтВрФакт = СложитьВремя(ИтВрФакт, стр.ВремяФакт);
				ТабДок.Вывести(ОблСтрока);
				
				сч = сч + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ОблСтрока = Макет.ПолучитьОбласть("СтрокаИтогПлан");	
	ОблСтрока.Параметры.Время = ФорматИтога(ИтВр);
	если не СокрВид Тогда
		ОблСтрока.Параметры.ВремяФакт = ФорматИтога(ИтВрФакт);
	КонецЕсли;
	ТабДок.Вывести(ОблСтрока);
	
	// 
	ОблПодпись = Макет.ПолучитьОбласть("Подвал");
	Если не Объект.Пост.Родитель.Пустая() и Объект.Пост.Родитель.Сотрудники.Количество()>0 Тогда
		ОблПодпись.Параметры.Утвердил = Объект.Пост.Родитель.Сотрудники[0].ФизЛицо;
	Иначе
		ОблПодпись.Параметры.Утвердил = Объект.Утвердил;
	КонецЕсли;
	ТабДок.Вывести(ОблПодпись);
	//

	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ ЭтоНовый Тогда
		Оповестить("ИА_ПланыДействий_Запись", Объект.Ссылка); 
	Иначе
		Оповестить("ИА_ПланыДействий_Создание", Объект.Ссылка);
		ЭтоНовый = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МоиПолучитьПосты(Польз = Неопределено)
	
	Если Польз = Неопределено Тогда
		 Польз = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост,
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_АдресацияЗадачПланаДействий.Пост.ТипТерминала.Порядок";
	Запрос.УстановитьПараметр("Пользователь", польз);
	
	ТЗ = Запрос.Выполнить().Выгрузить();

	Если ТЗ.Количество() > 0 Тогда
		Возврат ТЗ.ВыгрузитьКолонку("Пост");
	Иначе
		Возврат новый Массив;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ШагиПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено 
		и ВидГруппировки <> ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") 
		и Элемент.ТекущиеДанные.Группировка<>Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуБезФормулы(Команда)
	Новстр = Дерево.ПолучитьЭлементы().Добавить();
	Новстр.Содержание = "";
	Новстр.Пост = ?(ПоследнийВыбПост.Пустая(), Объект.Пост, ПоследнийВыбПост);	
	Новстр.ВремяПлан = Дата(1,1,1);
	Новстр.ВремяФакт = Дата(1,1,1);

	Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуПоФормуле(Команда)
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		Новстр = Дерево.ПолучитьЭлементы().Добавить();
		Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач") Тогда
			Новстр.Группировка = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачБП.Задачи");
		КонецЕсли;
	Иначе
		тд = Элементы.Шаги.ТекущиеДанные;
		Если тд = Неопределено ИЛИ (не ЗначениеЗаполнено(тд.Группировка)) Тогда
			возврат;
		КонецЕсли;
		Если тд.ПолучитьРодителя() <> Неопределено Тогда
			тд = тд.ПолучитьРодителя();
		КонецЕсли;
			
		Новстр = тд.ПолучитьЭлементы().Добавить();
		Новстр.Группировка = тд.Группировка;
	КонецЕсли;
	
	Новстр.Содержание = "";
	Новстр.Пост = ?(ПоследнийВыбПост.Пустая(), Объект.Пост, ПоследнийВыбПост);
	
	Новстр.ВремяПлан = Дата(1,1,1);
	Новстр.ВремяФакт = Дата(1,1,1);
	
	Если ВидГруппировки <> ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		тс = Элементы.Шаги.ТекущаяСтрока;
		Если не Элементы.Шаги.Развернут(тс) Тогда
			Элементы.Шаги.Развернуть(тс);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Шаги.очистить(); // для старых планов
	
	Если не ТекущийОбъект.Родитель.Пустая() ТОгда // это дневной
		Если ТекущийОбъект.ДатаКонца > ТекущийОбъект.Родитель.ДатаКонца или ТекущийОбъект.ДатаНачала < ТекущийОбъект.Родитель.ДатаНачала Тогда
			Сообщить("Дата плана не совпадает с недельным планом!");
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция СложитьВремя(в1, в2)
	Если не ЗначениеЗаполнено(в2) Тогда
		возврат в1;
	КонецЕсли;
	
	возврат в1 + (в2 - Дата(1,1,1));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИтога(д1)
	
	Если д1 = дата(1,1,1) Тогда
		возврат "";
	КонецЕсли;
	
	КолЧасов = (День(д1)-1)*24 + Час(д1);
	возврат формат(КолЧасов,"ЧЦ=2; ЧН=; ЧВН=")+":"+формат(Минута(д1),"ЧЦ=2; ЧН=; ЧВН=");
КонецФункции

&НаКлиенте
Процедура ВывестиИтогВремени()
	
	ВремяИтого = Дата(1,1,1);
	ВремяИтогоФакт = Дата(1,1,1);
	Выполнено1 = Дата(1,1,1);
	
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		Для каждого стр1 из Дерево.ПолучитьЭлементы() Цикл // задачи
			ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
			ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
			Если стр1.Выполнено Тогда
				Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого стр из Дерево.ПолучитьЭлементы() Цикл  // шаги, типы		
			Если стр.Группировка = Неопределено Тогда
				ВремяИтого = СложитьВремя(ВремяИтого , стр.ВремяПлан);  
				ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр.ВремяФакт);  
				Если стр.Выполнено Тогда
					Выполнено1 = СложитьВремя(Выполнено1 , стр.ВремяПлан);
				КонецЕсли;
			Иначе
				Итог11 = Дата(1,1,1);
				Итог11Ф = Дата(1,1,1);
				Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
					ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
					ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
					
					Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
					Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
					Если стр1.Выполнено Тогда
						Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
					КонецЕсли;
				КонецЦикла;
				стр.ВремяПлан = ФорматИтога(Итог11);
				стр.ВремяФакт = ФорматИтога(Итог11Ф);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	время = ФорматИтога(ВремяИтого);
	ВремяФакт = ФорматИтога(ВремяИтогоФакт);

	Выполнено = ФорматИтога(Выполнено1);;
КонецПроцедуры

&НаКлиенте
Процедура ШагиВремяПриИзменении(Элемент)
	ВывестиИтогВремени();
КонецПроцедуры

&НаКлиенте
Процедура ПланВидСтатистикиПриИзменении(Элемент)
	тд = Элементы.План.ТекущиеДанные;
	тд.ПредыдущийПлан = ИА_Планы.ПолучитьПредыдущуюКвоту(тд.ВидСтатистики,Объект.Ответственный,Объект.Родитель, Объект.ДатаНачала); 
	тд.Аналитика1 = Неопределено;
	тд.Аналитика2 = Неопределено;
	тд.Аналитика3 = Неопределено;
	тд.ТекущееЗначениеСтатистики = ИА_Планы.ПолучитьЗначениеСтатистики(тд.ВидСтатистики, Неопределено, Неопределено, Неопределено, Объект.ДатаНачала, Объект.Родитель);
	СформироватьНаименование()
КонецПроцедуры


&НаСервере
Процедура ОбновитьДатыПриИзмДатыНачала()
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		Если Объект.ДатаНачала < Объект.Родитель.ДатаНачала Тогда
			Объект.ДатаНачала = Объект.Родитель.ДатаНачала;
		ИначеЕсли Объект.ДатаНачала > Объект.Родитель.ДатаКонца Тогда
			Объект.ДатаНачала = Объект.Родитель.ДатаКонца;
		КонецЕсли;	
		Объект.ДатаКонца = Объект.ДатаНачала;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда // дневной
		Объект.ДатаКонца = Объект.ДатаНачала;
	Иначе // недельный
		Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			Объект.ДатаКонца = Объект.ДатаНачала + 6*60*60*24; 
		Иначе
			Объект.ДатаКонца = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОбновитьДатыПриИзмДатыНачала();
	
	ОбновитьЗначенияСтатистик();
	ОбновитьДневник(Неопределено);
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДат()
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда // дневной
		Объект.ДатаНачала = Объект.Родитель.ДатаНачала;
		Объект.ДатаКонца = Объект.Родитель.ДатаНачала;
	Иначе // недельный
		Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			Объект.ДатаКонца = Объект.ДатаНачала + 6*60*60*24; 
		Иначе
			Объект.ДатаКонца = Дата(1,1,1);
		КонецЕсли;		
	КонецЕсли;

	ОбновитьЗаголовкиВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиВидимость()
	
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда // дневной		
		Элементы.ДатаКонца.Видимость = Ложь;
		Элементы.ДатаНачала.Заголовок = "день";		
		Элементы.ДекорацияБП.Заголовок  = "БОЕВОЙ ПЛАН НА ДЕНЬ";
		Элементы.Родитель.Видимость = истина;
		
		Элементы.ПланПредыдущийПлан.Заголовок  = "Квота прошлого дня";
		Элементы.ПланТекущееЗначениеСтатистики.Заголовок  = "Факт прошлого дня";
		Элементы.ПланКвотаПлан.Заголовок  = "Квота на следующий день";
	Иначе // недельный		
		Элементы.ДатаКонца.Видимость = Истина;
		Элементы.ДатаНачала.Заголовок = "начало недели";
		
		Элементы.ДекорацияБП.Заголовок  = "БОЕВОЙ ПЛАН НА НЕДЕЛЮ";
		Элементы.Родитель.Видимость = ложь;
		
		Элементы.ПланПредыдущийПлан.Заголовок  = "Квота прошлой недели";
		Элементы.ПланТекущееЗначениеСтатистики.Заголовок  = "Факт прошлой недели";
		Элементы.ПланКвотаПлан.Заголовок  = "Квота на следующую неделю";
	КонецЕсли;
	
	Если СокрВид Тогда
		Элементы.ШагиПродукт.Видимость = ложь;
		Элементы.ШагиСрокИсполнения.Видимость = ложь;
		Элементы.ШагиВремяФакт.Видимость = ложь;
		Элементы.ШагиСодержание.Заголовок = "Задача";
	КонецЕсли;
	
	Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.НеГруппировать Тогда
		Элементы.Шаги.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	Элементы.ШагиДобавитьЗадачуБезФормулы.Видимость = ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния;
	Элементы.Состояние.Видимость = ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния;
	Элементы.Ситуация.Видимость = ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначенияСтатистик()
	Для каждого стр из Объект.План Цикл
		стр.ТекущееЗначениеСтатистики = ИА_Планы.ПолучитьЗначениеСтатистики(стр.ВидСтатистики, стр.Аналитика1, стр.Аналитика2, стр.Аналитика3, Объект.ДатаНачала, Объект.Родитель);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтатистику(Команда)	
	Если не Объект.Пост.Пустая() Тогда
		настр = ПолучитьНастройкуСтатистики(Объект.Пост);
		Если ЗначениеЗаполнено(настр) Тогда
			ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма");
			ф.Объект.Настройка = настр;
			Если ЗначениеЗаполнено(Объект.Родитель) Тогда  // дневной
				ф.Объект.ДатаКонца = Объект.ДатаНачала - 60*60*24;    // 6 дней назад
				ф.Объект.ДатаНачала = Объект.ДатаНачала - 60*60*24*6;
			Иначе // недельный
				ф.Объект.ДатаКонца = Объект.ДатаНачала - 60*60*24;
				ф.Объект.ДатаНачала = Объект.ДатаНачала - 60*60*24*7*6; // 6 недель назад
			КонецЕсли;
			
			ф.Открыть();
			ф.ЗагрузитьНастройкуБезПериодов();
		Иначе
			Сообщить("У поста не указана настройка статистик!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПостПриИзменении(Элемент)
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтатистики(МоиПосты)
	Объект.План.Очистить();
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.НастройкаСтатистик,
	               |	ОргСхема.Ссылка КАК Пост,
	               |	ОргСхема.ТипТерминала.Порядок КАК Порядок
	               |ПОМЕСТИТЬ Настройки
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В(&Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
	               |	МАКСИМУМ(Настройки.Порядок) КАК Порядок,
	               |	МАКСИМУМ(Настройки.Пост) КАК Пост,
	               |	МИНИМУМ(ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ РезТЗ
	               |ИЗ
	               |	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Настройки КАК Настройки
	               |		ПО (Настройки.НастройкаСтатистик = ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Пост,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Порядок КАК Порядок
	               |ИЗ
	               |	РезТЗ КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", МоиПосты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Новстр = Объект.План.Добавить();
		Новстр.ВидСтатистики = Выборка.ВидСтатистики;
		Новстр.Аналитика1 = Выборка.Аналитика1;
		Новстр.Аналитика2 = Выборка.Аналитика2;
		Новстр.Аналитика3 = Выборка.Аналитика3;
		Новстр.Пост = Выборка.Пост;
		Новстр.ПредыдущийПлан = ИА_Планы.ПолучитьПредыдущуюКвоту(Выборка.ВидСтатистики,Объект.Ответственный,Объект.Родитель, Объект.ДатаНачала);
		Новстр.ТекущееЗначениеСтатистики = ИА_Планы.ПолучитьЗначениеСтатистики(Новстр.ВидСтатистики,Новстр.Аналитика1,Новстр.Аналитика2,Новстр.Аналитика3, Объект.ДатаНачала, Объект.Родитель);			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ПроверкаДат();
	ОбновитьЗначенияСтатистик();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуИзПрограммы(Команда)
	тд = Элементы.План.ТекущиеДанные;
	Если тд<>Неопределено и не тд.пост.пустая() Тогда
		Парам = Новый Структура("Отбор_ЗадачиПоста,РежимВыбора,Отбор_ТолькоНезавершенные",тд.пост,истина,истина);
		ОткрытьФорму("Обработка.ИА_РабочийСтолСтратегическогоУправления.Форма.Форма",Парам,,УникальныйИдентификатор,,, Новый ОписаниеОповещения("ДобавитьЗадачуИзПрограммыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	Сообщить("Не заполнен пост! Добавление задачи из программы невозможно!");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуИзПрограммыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ЗначениеЗаполнено(рез) тогда
		
		
		Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") или ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.ПоШагамСостояния") Тогда
			тд = Дерево;
		Иначе	
			тд = Неопределено;
			Для каждого стр из Дерево.ПолучитьЭлементы() Цикл
				Если стр.Группировка = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачБП.Стратегические") Тогда
					тд = стр;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если тд = Неопределено Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		текСтроки = тд.ПолучитьЭлементы();
		Новстр = текСтроки.Добавить();
		Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач") Тогда
			Новстр.Группировка = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачБП.Стратегические");
		КонецЕсли;
		Новстр.Содержание = рез.Содержание;
		
		Если ВидГруппировки <> ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
			тс = Элементы.Шаги.ТекущаяСтрока;
			Если не Элементы.Шаги.Развернут(тс) Тогда
				Элементы.Шаги.Развернуть(тс);
			КонецЕсли;	
		КонецЕсли;
		
		Новстр.ВремяПлан = Дата(1,1,1);
		Новстр.ВремяФакт = Дата(1,1,1);
		
		Новстр.ЗадачаОснование = рез.ссылка;
		Новстр.Пост = рез.Ответственный;
		Новстр.индКартинки = 2;
		
		Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШагиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ВывестиИтогВремени();
КонецПроцедуры

&НаКлиенте
Процедура ШагиПослеУдаления(Элемент)
	ВывестиИтогВремени();
КонецПроцедуры

&НаКлиенте
Процедура ШагиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШагиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	СтандартнаяОбработка = Ложь;
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;

	ИсхСтрока = Дерево.НайтиПоИдентификатору(Выбор);
	РезСтрока = Дерево.НайтиПоИдентификатору(Строка);

	Если РезСтрока.ПолучитьРодителя() = Неопределено Тогда
		Если РезСтрока.УО = 0 Тогда   
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
			Возврат;
		КонецЕсли;
		Новстр = РезСтрока.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ИсхСтрока);
		Новстр.Группировка = РезСтрока.Группировка;
	Иначе // строка плана 
		Новстр = РезСтрока.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, ИсхСтрока);
		Новстр.Группировка = РезСтрока.Группировка;
	КонецЕсли;
	
	Если РезСтрока = Неопределено и Новстр<>Неопределено Тогда 
			Элементы["Шаги"].Развернуть(Новстр.ПолучитьИдентификатор(), Истина); 
	КонецЕсли;

	Родитель = ИсхСтрока.ПолучитьРодителя(); 
	Если Не Родитель = Неопределено Тогда
		Родитель.ПолучитьЭлементы().Удалить(ИсхСтрока);
	Иначе //нету родителя
		Дерево.ПолучитьЭлементы().Удалить(ИсхСтрока);
	КонецЕсли;  
	// Для "красоты" развернем ветвь-родителя 
	Если НЕ РезСтрока = Неопределено Тогда 
		Элементы["Шаги"].Развернуть(Строка, Истина); 
	КонецЕсли;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте    
Функция ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Знач НовыйРодитель) 
	
	Пока НЕ НовыйРодитель = Неопределено Цикл 
		Если ПереносимыйЭлемент = НовыйРодитель Тогда 
			Возврат Ложь; 
		КонецЕсли; 
		НовыйРодитель = НовыйРодитель.ПолучитьРодителя(); 
	КонецЦикла; 

	Возврат Истина; 

КонецФункции

&НаКлиенте
Процедура ШагиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Элемент.ТекущиеДанные.Содержание) <> тип("Строка") 
		или ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
		
	НовыйРодитель = ?(Строка = Неопределено, Неопределено,	Дерево.НайтиПоИдентификатору(Строка));
	
	Если НовыйРодитель = Неопределено или НовыйРодитель.Группировка = Неопределено Тогда 
		ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена; 
		Возврат;
	КонецЕсли;
	 
	МассивИДПереносимыхЭлементов = ПараметрыПеретаскивания.Значение; 
	Для каждого ИДПереносимыйЭлемент из МассивИДПереносимыхЭлементов Цикл 
		ПереносимыйЭлемент = Дерево.НайтиПоИдентификатору(ИДПереносимыйЭлемент); 
		Если НЕ ПроверитьВозможностьПереноса(ПереносимыйЭлемент, НовыйРодитель) Тогда 
			ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена; 
			Прервать; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ШагиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если ТипЗнч(Элемент.ТекущиеДанные.Содержание) <> тип("Строка") Тогда
		ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = Новый Структура("Ответственный", Объект.Ответственный);
	ПараметрыВыбора1 = Новый Структура("Отбор", Отборы);

	ОткрытьФорму("Справочник.ИА_ПланыДействий.ФормаВыбора", ПараметрыВыбора1, Элемент,,,, Новый ОписаниеОповещения("РодительНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 	
	
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат<> Неопределено Тогда
		Объект.Родитель = Результат;
	КонецЕсли;

КонецПроцедуры


///////// ДНЕВНИК

&НаКлиенте
Процедура ПоказатьСкрытьДневник(Команда)
	Элементы.ГруппаДневник.Видимость = не Элементы.ГруппаДневник.Видимость;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДневник(Команда)
	ОбновитьДневникСервер();
	обновитьНовыеСостояния();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДневникСервер()
	тз = ИА_Планы.ПолучитьДневникСервер(ДневникПериодС, КонецДня(Объект.ДатаКонца), Объект.Пост);
	ЗначениеВРеквизитФормы(тз ,"Дневник");
КонецПроцедуры

&НаКлиенте
Процедура ДневникПериодСПриИзменении(Элемент)
	ОбновитьДневник(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
	ОбновитьДневник(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДневникПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		стрДн = Новый Структура("Период,ИД,Пост,Наклон,Состояние,Шаг,Задача,Выполнено,ДатаВыполнения");
		ЗаполнитьЗначенияСвойств(стрДн, тд);
		ИА_Планы.СохранитьИзмененияДневника(стрДн);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДневникПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ДневникПередУдалениемЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДневникПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		тд = Элементы.Дневник.ТекущиеДанные;
	
		Если тд<>Неопределено Тогда 
			ИА_Планы.УдалитьСтрокуДневника(тд.ИД);
			Дневник.Удалить(тд);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневник(Команда)
	ДобавитьСтрокуВДневникКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДневникКлиент(Задача = "")
	Если Объект.пост.Пустая() Тогда
		Сообщить("Укажите пост!");
		Возврат;
	КонецЕсли;
		
	новстр = Дневник.Вставить(0);
	новстр.ИД = новый УникальныйИдентификатор;
	новстр.Период = ТекущаяДата();
	новстр.пост = Объект.Пост;
	новстр.Задача =  Задача;
	
	Если Дневник.Количество()>1 Тогда
		ПредСтрока = Дневник[Дневник.Количество()-2];
		новстр.Шаг = ПредСтрока.Шаг;
		новстр.Состояние = ПредСтрока.Состояние;
	КонецЕсли;
	
	Элементы.Дневник.ТекущаяСтрока = новстр.ПолучитьИдентификатор();
КонецПроцедуры


&НаКлиенте
Процедура ДневникСостояниеПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	тд.Шаг = ИА_Планы.ПолучитьПервыйШаг(тд.Состояние);
	
	ДневникПриИзменении(Неопределено);
	обновитьНовыеСостояния();
КонецПроцедуры


&НаКлиенте
Процедура ДневникНаклонПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		Если тд.наклон.Пустая() Тогда
			тд.ИндексКартинки = -1;
		Иначе
			тд.ИндексКартинки = ИА_Планы.ПолучитьПорядок(тд.Наклон);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДневникВыполненоПриИзменении(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	
	Если тд<>Неопределено Тогда 
		Если тд.Выполнено Тогда
			тд.ДатаВыполнения = ТекущаяДата();
		Иначе
			тд.ДатаВыполнения = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДневникПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	МассивВыбора = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(МассивВыбора) = Тип("Массив") Тогда
		Выбор = МассивВыбора[0];
	Иначе
		Выбор = МассивВыбора;
	КонецЕсли;

	тд = Элементы.Дневник.ТекущиеДанные;
	
	ДобавитьСтрокуВДневникКлиент(Выбор.Содержание);
	
КонецПроцедуры


&НаКлиенте
Процедура ДневникПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	РеквизитДерево = ЭтаФорма["Дерево"];
	Если ТипЗнч(Элементы.Шаги.ТекущиеДанные.Содержание) = тип("ПеречислениеСсылка.ИА_ТипыЗадачБП") Тогда
		ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДневника(Команда)
	ТабДок = ПечатьДневника_Сервер();
	ТабДок.Показать();	
КонецПроцедуры

&НаСервере
Функция ПечатьДневника_Сервер()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Справочники.ИА_ПланыДействий.ПолучитьМакет("Дневник");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.Должность = Объект.Пост;
	Если Объект.План.Количество()>0 Тогда
		ОблШапка.Параметры.Статистика = Объект.План[0].ВидСтатистики;
	КонецЕсли;
	
	ТабДок.Вывести(ОблШапка);
	
	// Посты
	Для каждого стр из Дневник Цикл
		Если стр.НовоеСостояние Тогда
			ОблСтрока = Макет.ПолучитьОбласть("СтрокаРазрыв");
			ТабДок.Вывести(ОблСтрока);
		КонецЕсли;
		
		Если стр.Наклон.Пустая() Тогда
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
		Иначе
			порядок = ИА_Планы.ПолучитьПорядок(стр.Наклон) + 1;
			ОблСтрока = Макет.ПолучитьОбласть("Строка"+порядок);
		КонецЕсли;
		ОблСтрока.Параметры.Заполнить(стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ДневникПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура обновитьНовыеСостояния()
	ПредСост = Неопределено;
	инд = Дневник.Количество()-1;
	
	Пока инд >= 0 Цикл
		стр = Дневник[инд];
		Стр.НовоеСостояние = стр.Состояние <> ПредСост и ПредСост<>Неопределено;
		ПредСост = стр.Состояние;
		
		инд = инд - 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДневникПослеУдаления(Элемент)
	обновитьНовыеСостояния();
КонецПроцедуры

&НаКлиенте
Процедура ДневникПриАктивизацииПоля(Элемент)
	тд = Элементы.Дневник.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		массивШагов = ИА_Планы.ПолучитьШагиСостояния(тд.Состояние); 
		Элемент.ПодчиненныеЭлементы.ДневникШаг.СписокВыбора.ЗагрузитьЗначения(массивШагов);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьЗаполнениеСтроки(стрДанных, отказ)
	Если стрДанных.ВремяПлан = дата(1,1,1) Тогда
		ПоказатьПредупреждение(,"Укажите время!");
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	Если стрДанных.Пост.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите пост!");
		Отказ = Истина;
		возврат;
	КонецЕсли;

КонецПроцедуры	
	
	
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		для каждого стр из Дерево.ПолучитьЭлементы() Цикл
			ПроверитьЗаполнениеСтроки(стр, отказ);		
		КонецЦикла;
	Иначе
		для каждого стр из Дерево.ПолучитьЭлементы() Цикл
			если стр.Группировка = Неопределено ТОгда
				ПроверитьЗаполнениеСтроки(стр, отказ);		
			КонецЕсли;
			Для каждого стр1 из стр.ПолучитьЭлементы() Цикл
				ПроверитьЗаполнениеСтроки(стр1, отказ);		
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШагиВыполненоПриИзменении(Элемент)
	
	тдП = Элементы.Шаги.ТекущиеДанные;

	Если тдП.Выполнено и тдП.ВремяФакт = Дата(1,1,1) Тогда
		тдП.ВремяФакт = тдП.ВремяПлан;
	КонецЕсли;
	
	Если тдП.Выполнено И ЗначениеЗаполнено(тдП.ЗадачаОснование) Тогда
		структЗадача = Новый Структура("ЗадачаОснование,Выполнено", тдП.ЗадачаОснование, тдП.Выполнено); 
		ИА_Планы_Клиент.ЗавершитьЗадачуОснование(структЗадача);
	КонецЕсли;
	
	ВывестиИтогВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура ШагиВремяФактПриИзменении(Элемент)
	тд = Элементы.Шаги.ТекущиеДанные;
	Если тд.Выполнено и тд.ВремяФакт = Дата(1,1,1) Тогда
		тд.ВремяФакт = тд.ВремяПлан;
	КонецЕсли;
	ВывестиИтогВремени();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуДляДобавления(Группировка)
	Если ВидГруппировки <> Перечисления.КСУ_ГруппировкаЗадачПлана.ПоВидуЗадач Тогда
		тд = Дерево;
	Иначе
		тд = Неопределено;
		Для каждого стр из Дерево.ПолучитьЭлементы() Цикл
			Если стр.Группировка = Группировка Тогда
				тд = стр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	возврат тд;
КонецФункции

&НаСервере
Процедура ДобавитьВсеСтратегическиеЗадачи()
	Если Объект.ДатаНачала = Дата(1,1,1) или Объект.ДатаКонца = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли;
	
	задачиС = ПолучитьЗадачиСтратегии(Объект.Ответственный, объект.ДатаНачала, объект.ДатаКонца);
	
	Если задачиС.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.НеГруппировать Тогда
		тд = Дерево;
	Иначе		
		тд = ПолучитьСтрокуДляДобавления(Перечисления.ИА_ТипыЗадачБП.Стратегические);
	
		Если тд = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	текСтроки = тд.ПолучитьЭлементы();
	
	Новстр = Неопределено;
	Для каждого стр из задачиС Цикл
		Прерв = ложь;
		для каждого стр1 из текСтроки Цикл
			если стр1.ЗадачаОснование = стр.ссылка Тогда
				прерв = истина;
				прервать;
			КонецЕсли;
		КонецЦикла;
		Если прерв Тогда
			продолжить;
		КонецЕсли;
		
		Новстр = текСтроки.Добавить();
		Новстр.Группировка = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачБП.Стратегические");
		Новстр.Содержание = стр.Содержание;
		Новстр.СрокИсполнения = стр.СрокИсполнения;
		Новстр.ВремяПлан = Дата(1,1,1,1,0,0);
		Новстр.ВремяФакт = Дата(1,1,1);
		Новстр.ЗадачаОснование = стр.ссылка;
		Новстр.Пост = Объект.Пост;
		Новстр.индКартинки = 2;
	КонецЦикла;
	
	Если Новстр <> Неопределено Тогда 
		Элементы.Шаги.ТекущаяСтрока = Новстр.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗадачиСтратегии(ответственный, ДатаНачала, ДатаКонца)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_СтратегическоеУправление.Содержание,
	               |	ИА_СтратегическоеУправление.Срок КАК СрокИсполнения,
	               |	ИА_СтратегическоеУправление.ЧасовНаВыполнение КАК ВремяЧасы,
	               |	ИА_СтратегическоеУправление.Ссылка
	               |ИЗ
	               |	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |		ПО ИА_СтратегическоеУправление.Ответственный = ИА_АдресацияЗадачПланаДействий.Пост И ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |ГДЕ
	               |	ИА_СтратегическоеУправление.ДатаНачала <= &ДатаКонца
	               |	И ИА_СтратегическоеУправление.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ИА_СтратегическоеУправление.Срок >= &ДатаНачала
	               |	И ИА_СтратегическоеУправление.Выполнено = ЛОЖЬ
	               |	И ИА_СтратегическоеУправление.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача)
	               |	И ИА_СтратегическоеУправление.ЭтоКоррекция = ЛОЖЬ
				   |	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", ответственный);
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца",ДатаКонца);
	
	рез = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		рез.Добавить(Новый Структура("Содержание,СрокИсполнения,ВремяЧасы,Ссылка",Выборка.Содержание,Выборка.СрокИсполнения,Выборка.ВремяЧасы,Выборка.Ссылка  ));
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

&НаСервере
Процедура УтвержденоПриИзмененииНаСервере()
	Если Объект.Утверждено Тогда
		Объект.ДатаУтверждения = ТекущаяДата();
		Объект.Утвердил = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Объект.ДатаУтверждения = Дата(1,1,1);
		Объект.Утвердил = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УтвержденоПриИзменении(Элемент)
	УтвержденоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Попытка
		НачатьТранзакцию();
			ЗаписатьШаги(ТекущийОбъект.Ссылка);
		ЗафиксироватьТранзакцию();
		
		Если не ТекущийОбъект.Родитель.Пустая() Тогда // дневной
			ИА_Планы.РаспределитьЗадачиДневногоПлана(ТекущийОбъект.Ссылка);
		КонецЕсли;
	Исключение
		отказ = Истина;
		сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтрокуШага(стрЗадача, Владелец,ссылкиШаг, Порядок)
	Если стрЗадача.ссылка.Пустая() ТОгда
		ЗадачаОб = Справочники.ИА_ЗадачиПлана.СоздатьЭлемент();
		ЗадачаОб.Владелец = Владелец;
		
		Если ТипЗнч(стрЗадача.ЗадачаОснование) = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") и стрЗадача.ЗадачаОснование.Отложена = ложь Тогда
			обЗадача = стрЗадача.ЗадачаОснование.получитьобъект();
			обЗадача.Отложена = истина;
			обЗадача.записать();
		КонецЕсли;
	Иначе
		ЗадачаОб = стрЗадача.ссылка.ПолучитьОбъект(); 
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗадачаОб, стрЗадача,,"Родитель");
	ЗадачаОб.СформироватьНаименование();
	
	ЗадачаОб.Порядок = Порядок;
	
	ЗадачаОб.Записать();
	стрЗадача.Ссылка = ЗадачаОб.Ссылка; 
	ссылкиШаг.Добавить(стрЗадача.ссылка);
	Порядок = Порядок + 1;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьШаги(Владелец)
	Дер = РеквизитФормыВЗначение("Дерево");
	ссылкиШаг = новый Массив;
	
	Порядок = 1;
	Если ВидГруппировки = Перечисления.КСУ_ГруппировкаЗадачПлана.НеГруппировать Тогда
		Для каждого стр из Дер.Строки Цикл
			ЗаписатьСтрокуШага(стр, Владелец,ссылкиШаг, Порядок);
		КонецЦикла;
	Иначе
		Для каждого стр из Дер.Строки Цикл
			если стр.Группировка = Неопределено Тогда
				ЗаписатьСтрокуШага(стр, Владелец,ссылкиШаг, Порядок);
			КонецЕсли;
			Для каждого стрЗадача из стр.Строки Цикл
				ЗаписатьСтрокуШага(стрЗадача, Владелец,ссылкиШаг, Порядок);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ЗначениеВРеквизитФормы(дер,"Дерево");
	
	// удалим лишнее
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ЗадачиПлана.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
	               |ГДЕ
	               |	ИА_ЗадачиПлана.Владелец = &Владелец
	               |	И НЕ ИА_ЗадачиПлана.Ссылка В (&Ссылка)
	               |	И ИА_ЗадачиПлана.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", ссылкиШаг);
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		об = Выборка.ссылка.ПолучитьОбъект();
		об.УстановитьПометкуУдаления(истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШагиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если поле = Элементы.ШагииндКартинки Тогда
		задачаОснование = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока).задачаОснование;
		ПоказатьЗначение(,задачаОснование);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВсеСтратегическиеЗадачи1(Команда)
	ДобавитьВсеСтратегическиеЗадачи();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗадачиКЦ(Команда)
	ДобавитьВсеЗадачи();
КонецПроцедуры


&НаКлиенте
Процедура ШагиПостПриИзменении(Элемент)
	ПоследнийВыбПост = Элементы.Шаги.ТекущиеДанные.Пост;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСобытияИзКалендаряGoogle(Команда)
	ДобавитьСобытияГугл();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	обновитьДерево(объект.Ссылка);	
КонецПроцедуры


&НаКлиенте
Процедура ШагиПриАктивизацииСтроки(Элемент)
	тд = Элементы.Шаги.ТекущиеДанные;
	Если тд<>Неопределено Тогда
		можноДвигать = ТипЗнч(тд.Содержание)=тип("Строка");
		Элементы.ШагиКнопкаПереместитьВверх.Доступность = можноДвигать;
		Элементы.ШагиКнопкаПереместитьВниз.Доступность = можноДвигать;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтатистики(Команда)
	ОбновитьСтатистикиСервер();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикиСервер()
	для каждого Новстр из Объект.План Цикл
		Новстр.ТекущееЗначениеСтатистики = ИА_Планы.ПолучитьЗначениеСтатистики(Новстр.ВидСтатистики,Новстр.Аналитика1,Новстр.Аналитика2,Новстр.Аналитика3, Объект.ДатаНачала, Объект.Родитель);			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура GoogleКалендарь(Команда)
	ЗапуститьПриложение("https://calendar.google.com/");
КонецПроцедуры
